Autodesk.Revit.DB.Visual.SolidGlass.CommonTintColor
The property labeled "Tint Color" from the "SolidGlass" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
Since:
2018.1

Autodesk.Revit.DB.Visual.SolidGlass.CommonTintToggle
The property labeled "Tint" from the "SolidGlass" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.SolidGlass.SolidglassBumpAmount
The property labeled "Amount" from the "SolidGlass" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 2".
Since:
2018.1

Autodesk.Revit.DB.Visual.SolidGlass.SolidglassBumpMap
The property labeled "Image" from the "SolidGlass" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.SolidGlass.SolidglassBumpEnable
The property labeled "Type" from the "SolidGlass" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "SolidglassBumpEnableType".
Since:
2018.1

Autodesk.Revit.DB.Visual.SolidGlass.SolidglassGlossiness
The property labeled "Roughness" from the "SolidGlass" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.SolidGlass.SolidglassRefractionIor
The property labeled "Refraction" from the "SolidGlass" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0.01, 5".
Since:
2018.1

Autodesk.Revit.DB.Visual.SolidGlass.SolidglassReflectance
The property labeled "Reflectance" from the "SolidGlass" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.SolidGlass.SolidglassColorByObject
The property labeled "Custom Color" from the "SolidGlass" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.SolidGlass.SolidglassTransmittanceCustomColor
The property labeled "Custom Color" from the "SolidGlass" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.SolidGlass.SolidglassTransmittance
The property labeled "Color" from the "SolidGlass" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "SolidglassTransmittanceType".
Since:
2018.1

Autodesk.Revit.DB.Visual.SolidGlass
Represents the properties of materials.
Since:
2018.1